{
    "circle" : "&#9900;",
    "address" : {
        "logo" : "images/Logo-official-small.png",
        "address" : "1628 Route 206",
        "city" : "Tabernacle",
        "state" : "NJ",
        "zipcode" : "08088",
        "phone" : "(609)207-9572"
    },
    "hoursLong" : [
	{
    	   "day" : "Monday",
    	   "hours" : "9-5:00pm"
    	},
    	{
    	   "day" : "Tuesday",
    	   "hours" : "9-5:00pm"
    	},
    	{
    	   "day" : "Wednesday",
    	   "hours" : "9-5:00pm"
    	},
    	{
    	   "day" : "Thursday",
    	   "hours" : "9-5:00pm"
    	},
    	{
    	   "day" : "Friday",
    	   "hours" : "9-5:00pm"
    	},
    	{
    	   "day" : "Saturday",
    	   "hours" : "Gone Riding"
    	},
    	{
    	   "day" : "Sunday",
    	   "hours" : "Gone Riding"
    	}	
    ],
    "hoursShort" : "M-F: 9am-5:00pm, Sat-Sun: Gone Riding",
    "logo" : "images/Logo-official-small.png",
    "logoLight" : "images/Redline_logo_light_small.png",
    "home" : {
        "name" : "home",
        "headerBG" : "images/wallpaper.jpg",
        "videoBG" : {
            "mp4" : "videos/compressedFinal720.mp4",
            "ogg" : "videos/compressedFinal720.ogg",
            "webm" : "videos/compressedFinal720_webm.mkv"
        },
        "about" : "Here at Redline Motorcycles we excel at getting your Motorcycle, Dirt Bike, ATV, or UTV back up and running. With more than 35 years of combine service experience, Patrick and Daniel Doyle have all the knowledge and expertise to give you piece of mind. Quality work is what we strive for here at Redline Motorcycles so call us today at (609) 207-9572, or use the contact form below, to schedule service. If you receive our voicemail then please leave your name, contact phone number, an appropriate time to reach you, explain what vehicle you have, what the problem is, and we will return your call as soon as we can.",
        "brand" : "We work on just about every brand, and style of bike. From Cruisers to Crotch Rockets, Honda's to Harleys. Our specialization leans towards sports bikes from every brand, but we are equally comfortable working on metric and standard cruisers. Pat also specializes in Honda Goldwing’s of all years. For ATV's, we can wrench all of them from UTV's to sport quads, and every variation in between. WE DO NOT WORK ON OFF BRAND ATV's or TRIKE's.",
        "brandHeaderBG" : "images/Motorcycle-RideBlur.jpg",
        "bikes" : [
            {
                "name" : "Sport Bikes",
                "image" : "images/cbr.png"
            },
            {
                "name" : "Super Naked Bikes",
                "image" : "images/supernake.png"
            },
            {
                "name" : "Cruisers",
                "image" : "images/cruiser.png"
            },
            {
                "name" : "Touring Bikes",
                "image" : "images/cruiserTouring.png"
            },
            {
                "name" : "Retro Modern",
                "image" : "images/retroModern.png"
            },
            {
                "name" : "Dirt Bikes",
                "image" : "images/dirtbike.png"
            },
            {
                "name" : "ATV's",
                "image" : "images/atv.png"
            },
            {
                "name" : "UTV's",
                "image" : "images/utv.png"
            },
            {
                "name" : "Snowmobiles (seasonal)",
                "image" : "images/snowmobile.png"
            }
        ],
        "brands" : [
            {
                "name" : "Arctic Cat",
                "logo" : "images/Arctic_Cat_logo.png"
            },
            {
                "name" : "Can-Am/Bombardier",
                "logo" : "images/can-am_logo.png"
            },
            {
                "name" : "Honda",
                "logo" : "images/Honda-motorcycle-logo.png"
            },
            {
                "name" : "Husqvarna",
                "logo" : "images/husq-logo.png"
            },
            {
                "name" : "Kawasaki",
                "logo" : "images/Kawasaki-logo.png"
            },
            {
                "name" : "KTM",
                "logo" : "images/ktm-logo.png"
            },
            {
                "name" : "Kymco",
                "logo" : "images/kymco-logo.png"
            },
            {
                "name" : "Harley Davidson",
                "logo" : "images/logo-harley-davidson.png"
            },
            {
                "name" : "Yamaha",
                "logo" : "images/Logo-Yamaha.png"
            },
            {
                "name" : "Polaris",
                "logo" : "images/Polaris-Logo.png"
            },
            {
                "name" : "Suzuki",
                "logo" : "images/suzuki-transparent.png"
            },
            {
                "name" : "Triumph",
                "logo" : "images/Triumph-Logo.png"
                
            },
            {
                "name" : "Victory",
                "logo" : "images/Victory-logo.png"
            }
        ]
    },
    "service" : {
        "name" : "service",
        "headerBG" : "images/serviceBG-1.jpg",
        "cards" : [
            {
                "image" : "images/OilSpecial.svg",
                "imagePNG" : "images/OilSpecial.png",
                "nameProduct" : "Oil Change Special",
                "titlePrice" : "Call for Price",
                "bioDesc" : "The Oil Change Special is the final word in motorcycle oil changes. With this service, we change the oil and filter, check and set the tire pressures in both tires, lube and adjust chain (if applicable), adjust drive belt (if applicable), change final drive oil (if applicable), clean and tighten battery terminals, check and adjust controls, check and top off all fluids, check all lights for proper operation, and finally inspect brakes and tires for excessive wear! *phew* That's a lot! *price can vary"
            },
            {
                "image" : "images/service.svg",
                "imagePNG" : "images/service.png",
                "nameProduct" : "Service Diagnosis",
                "titlePrice" : "Call for Price*",
                "bioDesc" : "If your bike, or quad, is making a weird noise, has some strange behavior, or just isn't running right then bring it to us so that we can figure out exactly what is wrong with your vehicle. If we can fix your bike in the time allotted time then all is well, but if it’s something more involved, or requires the ordering of replacement parts then we will talk with you, and discuss your options. *price can vary"
            },
            {
                "image" : "images/WheelChange.svg",
                "imagePNG" : "images/WheelChange.png",
                "nameProduct" : "Tire Change",
                "titlePrice" : "Call for Price",
                "bioDesc" : "Tire change price varies depending on a few things 1) Do you already have a tire, or are we getting it for you? 2) Are you going to bring the whole bike in, or just bring us the wheel? 3) What kind of bike do you own? Sport bikes are typically the cheapest to change, and full dresser touring bikes the most expensive. Drop us a line, or contact us thru the contact form, and we can talk to you about the options and let you know how much it will be for your application."
            },
            {
                "image" : "images/service.svg",
                "imagePNG" : "images/service.png",
                "nameProduct" : "Acc. Builds",
                "titlePrice" : "Free",
                "bioDesc" : "Got an idea of how you want your bike to look, but don't quite know which parts to buy, or what will work? Well, we can help make sure you get the right parts that will work with your ride, and at competitive prices. Whether your building for power, handling, or looks, we can help you out."
            },
            {
                "image" : "images/brakes.svg",
                "imagePNG" : "images/brakes.png",
                "nameProduct" : "Brake Pads",
                "titlePrice" : "Call for Price",
                "bioDesc" : "Brakes are arguably the most important thing on your bike! You might have all the horsepower in the world, but if you can only enjoy it once before you meet the end of the road then there is little point. Keep your brakes in good working order with frequent pad changes and rotor inspections. Price can vary depending on your application, and what kind of pads you want so please contact us either by phone, or with the contact form to get a more accurate quote."
            },
            {
                "image" : "images/helmet.svg",
                "imagePNG" : "images/helmet.png",
                "nameProduct" : "Safety Check",
                "titlePrice" : "Call for Price",
                "bioDesc" : "Safety is the most important thing when riding a motorcycle. The freedom and open road are wonderful, but being able to reach your destination in one piece is just as wonderful. If you have any doubts about whether your ride is in tip top condition then bring it up to us. We check all your fluids, and top them off if need be, we check all your lights, we check your chain/belt/final drive to make sure everything is in safe working order, we check all your controls, make sure the wheels, tires, and brakes are up to snuff, set your tire pressures, and give your bike a once over for any other audible or visual clues that might hint to larger problems."
            },
            {
                "image" : "images/service.svg",
                "imagePNG" : "images/service.png",
                "nameProduct" : "Scheduled Service Intervals",
                "titlePrice" : "Price Varies",
                "bioDesc" : "We can take care of any of your scheduled service intervals for your bike or ATV. Whether its 5,000 miles or 50,000 miles, we have you covered. Price can vary depending on the service that is taking place so please contact us if you want something a bit more accurate."
            },
            {
                "image" : "images/helmet.svg",
                "imagePNG" : "images/helmet.png",
                "nameProduct" : "Crash Work",
                "titlePrice" : "Call for Price",
                "bioDesc" : "Unfortunately, no matter how safe you ride, accidents do happen. We can help you get your bike back together, working closely with your insurance provider to make it a seamless experience for you to get your bike back in one piece." 
            }
        ],
        "selector" : "",
        "serviceCat" : [
            {
                "name" : "seat",
                "title" : "Body and Accessories",
                "services" : [
                    {
                        "name" : "Body Panel Replacement",
                        "description" : "Whether it's from crash damage, or just replacing your fairing kit we can help you out. We do not paint panels here, but we work with local shops to get any service completed that you need."
                    },
                    {
                        "name" : "Body Accessory Installs",
                        "description" : "Got some saddlebags that you want put on? We have you covered. We can install most body accessories from lights to decals to aftermarket foot controls."
                    },
                    {
                        "name" : "Light Kit Installs",
                        "description" : "LED's make just about everything look cooler, but have you ever tried to install a kit on your bike? It's not that easy to get a nice clean look. We can professional install all lighting kits to give your ride that show bike appearance without you having to pull your hair out trying to install it yourself."
                    }
                ]
            },
            {
                "name" : "tank",
                "title" : "Fuel and Air",
                "services" : [
                    {
                        "name" : "Air Filter Replacement",
                        "description" : "Let your bike breath! Replace that old dirty filter with a sparkly brand new one."
                    },
                    {
                        "name" : "Fuel Tank De-Rusting",
                        "description" : "Bike been sitting outside for a while? Did you remember to drain the fuel? If your tank has gotten to the point where it looks like Fraggles might be taking up residence soon then bring it up to us so we can get it cleaned up for you."
                    },
                    {
                        "name" : "Carburetor Clean and Synchronization",
                        "description" : "If your bike or ATV is sputtering, shutting off, or sounds like it's choking in its own fluids then it’s possible you need to get your Carburetors fixed up. Prices vary depending on the bike."
                    },
                    {
                        "name" : "Jetting",
                        "description" : "Sometimes you need just a bit of extra sauce on your potato. Proper jetting can make a significant difference in the ride of your vehicle. Sometimes you jet for performance, and sometimes to get a bike back to proper operation. Get your bike breathing, and drinking correctly."
                    },
                    {
                        "name" : "Fuel Injector Replacement",
                        "description" : ""
                    }
                ]
            },
            {
                "name" : "controls",
                "title" : "Controls, Handlebars, Grips...",
                "services" : [
                    {
                        "name" : "Controls Adjustment",
                        "description" : "Set your controls just the way you need them."
                    },
                    {
                        "name" : "Handlebar Adjustment/Replacement",
                        "description" : "Adjust or replace your current handlebars. Even the tricky ones what have the cabling routed thru them! We do it all."
                    },
                    {
                        "name" : "Install Grips/Accessories",
                        "description" : "If you’re tired of your lame plain black grips, then get some flame chrome grips to match your bodacious attitude! If you just want some accessories to compliment your existing setup then we got you covered too."
                    },
                    {
                        "name" : "Headlight Install/Change",
                        "description" : "We can certainly do simple bulb swaps on your vehicle, but we also can put in LED or HID kits."
                    },
                    {
                        "name" : "Blinker Deletes",
                        "description" : "Get that nice flush look that makes your bike look slick. We can take care of the front and the rear if you have the proper hardware."
                    }
                ]
            },
            {
                "name" : "exhaust",
                "title" : "Exhaust, Foot pegs...",
                "services" : [
                    {
                        "name" : "Aftermarket Exhaust Install",
                        "description" : "'Loud Pipes Save Lives' so the saying goes. Get that amazing sound from your bike whether it's 'PO-ta-TO-e PO-ta-TO-e PO-ta-TO-e' or 'WHEEEEEE-NHEEEEEEEE' we can install it. Also, if you have a longer muffler, and just want a bit more noise then talk to us and we might be able to help you out."
                    },
                    {
                        "name" : "Foot Control Adjustment",
                        "description" : "Get your shifter and brake pedal setup just right so that you're safe and comfortable."
                    },
                    {
                        "name" : "Foot Control Accessories",
                        "description" : "Whether it's highway pegs, floorboards, or stock reinstalls we are there for you. We will get them on for you, then get them adjusted to the correct placement for you. "
                    }
                ]
            },
            {
                "name" : "engine",
                "title" : "Rebuilds, Carburetor, Injectors...",
                "services" : [
                    {
                        "name" : "Engine Rebuild",
                        "description" : "We can handle all sorts of rebuilds from when your engine just finally gave up the ghost, to when you are looking to build up your motor for some more power. Dan and Pat have been taking apart and rebuilding motorcycle engines for more than 35 years between them. You can be sure that the engine is in good hands here."
                    },
                    {
                        "name" : "Clutch Replacement",
                        "description" : "If your clutch is broken, worn out, or you just want a different one then we can handle it for you."
                    },
                    {
                        "name" : "Electrical Issues",
                        "description" : "Possibly the most frustrating of all issues, electrical issues can baffle one with their seemingly unrelated behaviors in comparison to where the problem lays. We are able to diagnose and fix any issue you can come across regarding electrical."
                    },
                    {
                        "name" : "Valve Adjustment/Replacement",
                        "description" : ""
                    },
                    {
                        "name" : "Engine Component Upgrades",
                        "description" : "Whether you’re looking for a new cylinder head, over-bored piston and cylinder, power commander install, or cam swap we can facilitate those needs."
                    }

                ]
            },
            {
                "name" : "frontWheel",
                "title" : "Front Brakes, Forks, Suspension...",
                "services" : [
                    {
                        "name" : "Fork Seals",
                        "description" : "Replace your blown and leaking fork seals! One of the most common points of wear on a motorcycles suspension."
                    },
                    {
                        "name" : "Front Suspension Adjustments",
                        "description" : "Get that perfect setup tailored to your riding style and proportions."
                    },
                    {
                        "name" : "Front Brakes",
                        "description" : "Either front brake pad replacement, or rotor(s). We have a large selection of brake pads in stock."
                    },
                    {
                        "name" : "Front Master Cylinder Repair/Replacement",
                        "description" : ""
                    },
                    {
                        "name" : "Wheel Bearing Replacement",
                        "description" : ""
                    },
                    {
                        "name" : "Steering Stem Bearing Replacement",
                        "description" : "Bike been feeling 'sticky'? Like it doesn't want to turn? Could be a steering stem bearing. We have you covered."
                    }
                ]
            },
            {
                "name" : "rearWheel",
                "title" : "Rear Chain, Brakes, Suspension... ",
                "services" : [
                    {
                        "name" : "Chain Adjustment",
                        "description" : "We can get your chain at the right tension."
                    },
                    {
                        "name" : "Rear Brakes",
                        "description" : "Either rear brake pad replacement, or rotor(s). We have a large selection of brake pads in stock."
                    },
                    {
                        "name" : "Rear Suspension Adjustments",
                        "description" : "Get that perfect setup tailored to your riding style and proportions."
                    },
                    {
                        "name" : "Wheel Bearing Replacement",
                        "description" : ""
                    },
                    {
                        "name" : "Rear Master Cylinder Repair/Replacement",
                        "description" : ""
                    }
                ]
            }
        ]
    },
    "team" : {
        "name" : "team",
        "headerBG" : "images/teamBG.jpg",
        "crewBG" : "images/original.jpg",
        "owners" : {
            "dan" : {
                "name" : "Daniel Doyle",
                "image" : "images/danCutout.png",
                "imageMobile" : "images/danSmall.jpg",
                "bio" : "Daniel is an avid outdoorsman who’s blood runs on gasoline. He has a strong passion for racing whether it be on two wheels in hare scrambles or four wheels at the drag strip. He was at the top of his class while attending tech school and has also been in the industry for 20+ years. He now is the other half of the Redline Motorcycles team."
            },
            "pat" : {
                "name" : "Patrick Doyle",
                "image" : "images/patCutout.png",
                "imageMobile" : "images/patSmall.jpg",
                "bio" : "Patrick grew up around motorcycles and ATVs, and has an undeniable passion for racing and riding all forms of both. That love of Powersports led him to enroll and graduate top of his class at AMI. Having completed over 20+ years at a large Honda and Yamaha dealer as the Lead Tech and Service Manager, he now stands alongside his brother as one half of Redline Motorcycles."
            }
        },
        "cards" : [
     
        ]
    },
    "media" : {
        "headerBG" :  "images/wallpaper.jpg"
    },
    "footer" : {
        "socialmedia" : [
            {
                "name" : "facebook",
                "icon" : "fa fa-facebook-official",
                "url" : "https://www.facebook.com/RedlineMotorcyclesNJ/"
            },
            {
                "name" : "twitter",
                "icon" : "fa fa-twitter-square",
                "url" : "https://twitter.com/RedlineMotorsNJ"
            },
            {
                "name" : "instagram",
                "icon" : "fa fa-instagram",
                "url" : "https://www.instagram.com/redlinemotorcycles/"
            },
            {
                "name" : "youtube",
                "icon" : "fa fa-youtube-square",
                "url" : "https://www.youtube.com/channel/UCvvw6B7KJ9Ye_3OGBNhvklA"
            },
            {
                "name" : "linkedin",
                "icon" : "fa fa-linkedin-square",
                "url" : "https://www.linkedin.com/in/redline-motorcycles/"
            }
        ]
    }
}